package Num3;

/**
 * Created by IVAN on 11/19/2016.
 */

/*

Задача C. Два подарка
Сеня выбирает себе подарки на новый год. Он знает, что Дед Мороз купит ему ровно
два подарка: один якобы от мамы, а другой якобы от папы.
В магазине, где Дед Мороз будет покупать подарки, продаётся n подарков, про каждый
подарок известна его цена: цена i-го подарка равна ai рублей. Сеня знает, что Дед Мороз
может потратить на покупку его подарков не больше x рублей. Разумеется, он хочет полу-
чить как можно более дорогие подарки. Таким образом, он хочет выбрать два различных
подарка с максимальной суммарной ценой, но при этом она не должна превышать x.
Помогите Сене выбрать себе подарки.
Формат входных данных
Первая строка ввода содержит два целых числа: n и x (2 ≤ n ≤ 100 000, 2 ≤ x ≤ 109
).
Вторая строка ввода содержит n целых чисел: a1, a2, . . . , an (1 ≤ ai ≤ 109
). Гарантируется,
что существует два подарка с суммарной ценой не больше x.
Формат выходных данных
Выведите одно целое число: максимальную суммарную цену двух различных подарков,
не превышающую x.
Пример
стандартный ввод стандартный вывод
6 18
5 3 10 2 4 9
1
 */
public class task_3_2 {
}
